Rokasbarasa1/ESP32-self-balancing-robot/src/main.c
        // Initialize values to be default again
        throttle = 0;
        yaw = gyro_degrees[2];// Use current yaw as default 
        pitch = 50;
        roll = 50;
        data_received = false;

        
        if(nrf24_data_available(1)){
            nrf24_receive(rx_data);

            // Get the type of request
            extract_request_type(rx_data, strlen(rx_data), rx_type);
            
            printf("'%s'\n", rx_type);

            for(uint i = 0; i < strlen(rx_data); i++){
                printf("%c", rx_data[i]);
            }
            printf("\n");
            

            if(strcmp(rx_type, "joystick") == 0){
                printf("Got joystick\n");
                extract_joystick_request_values(rx_data, strlen(rx_data), &throttle, &yaw, &pitch, &roll);
            }else if(strcmp(rx_type, "pid") == 0){
                printf("Got pid\n");

                double added_proportional = 0;
                double added_integral = 0;
                double added_derivative = 0;
                double added_master_gain = 0;

                extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);
                printf("Values %.2f\n", added_proportional);

                pitch_gain_p += added_proportional;
                pitch_gain_i += added_integral;
                pitch_gain_d += added_derivative;
                pitch_master_gain += added_master_gain;

                added_pitch_gain_p = added_proportional;
                added_pitch_gain_i = added_integral;
                added_pitch_gain_d = added_derivative;
                added_pitch_master_gain = added_master_gain;

            }else if(strcmp(rx_type, "remoteSyncBase") == 0){
                printf("Got sync base\n");
                send_pid_base_info_to_remote();
                printf("Done\n");
            }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
                printf("Got sync added\n");
                send_pid_added_info_to_remote();
                printf("Done\n");
            }

            rx_type[0] = '\0'; // Clear out the string
            data_received = true;
        }

        // React to the data received from sensors and remote control ###########################################################################################################

        if(gyro_degrees[0] < 45 && gyro_degrees[0] > -45){

            // Update pid targets by transforming remote input
            pitch_target = map_value(pitch, 0.0, 100.0, -20.0, 20.0);
            yaw_target = map_value(yaw, -20.0, 20.0, 0.0, 100.0);
            pid_set_desired_value(&pitch_pid, pitch_target);
            pid_set_desired_value(&yaw_pid, yaw_target);

            // CHeck that acceleration and gravity dont boost each other. 
            // If that is the case then it is wrong. Should not add speed in those cases
            // Also add a limit that the resulting speed cannot be more than 9.8 m/s after dividing that by hertz

            calculate_speeds_no_yaw(acceleration_data, gyro_degrees, acceleration_speed, esp_timer_get_time());

            float gyro_degrees_dead_zone_adjusted[3] = {0.0,0.0,0.0};
            gyro_degrees_dead_zone_adjusted[0] = apply_dead_zone(gyro_degrees[0], 180.0, -180.0, target_dead_zone_percent);
            gyro_degrees_dead_zone_adjusted[1] = apply_dead_zone(gyro_degrees[1], 180.0, -180.0, target_dead_zone_percent);
            gyro_degrees_dead_zone_adjusted[2] = apply_dead_zone(gyro_degrees[2], 180.0, -180.0, target_dead_zone_percent);

            error_pitch = map_value(pid_get_error(&pitch_pid, gyro_degrees_dead_zone_adjusted[0], esp_timer_get_time()), -90.0, 90.0, -100.0, 100.0);
            // error_yaw = map_value(pid_get_error(&yaw_pid, gyro_degrees[2], esp_timer_get_time()), -180.0, 180.0, -100.0, 100.0);
            // error_pitch = apply_dead_zone(error_pitch, 100.0, -100.0, target_dead_zone_percent);
            // error_speed_x = pid_get_error(&wheel_speed_x_pid, wheels_speed[1], esp_timer_get_time());

            // Try adding error of acceleration here
            float motor_a_control = (-error_pitch) + error_yaw - error_speed_x; // Decrease speed at the cost of pitch 
            float motor_b_control = (-error_pitch) - error_yaw - error_speed_x;

            change_speed_motor_A(motor_a_control, 31.5 - 2); // 31.5 - 2
            change_speed_motor_B(motor_b_control, 26.9 - 2); // 26.9 - 2

            optical_encoder_set_clockwise(optical_encoder_1_result , motor_a_control > 0);
            optical_encoder_set_clockwise(optical_encoder_2_result , motor_b_control > 0);

        }else{
            change_speed_motor_A(0, 0);
            change_speed_motor_B(0, 0);
        }

        // Monitoring ###########################################################################################################################################################

        // printf("SPEED, %9.5f, %9.5f, %9.5f, ", speed[0], error_speed_x, 100.0);
        // printf(" Loop Scanner 1 - %d   %9.5f  ", 
        //     optical_encoder_get_count(optical_encoder_2_result),
        //     optical_encoder_get_hertz(optical_encoder_2_result, 2.55, -2.55)
        // );
        // printf("ACCEL, %6.2f, %6.2f, %6.2f, ", acceleration_data[0], acceleration_data[1], acceleration_data[2]);
        // printf("GYRO, %6.2f, %6.2f, %6.2f, ", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
        // printf("ERROR, %6.2f, %6.2f, ", error_pitch, error_speed_x);

        // printf("TARGET, %6.2f, ", pitch_target);
        // printf("MAG, %6.2f, %6.2f, %6.2f, ", magnetometer_data[0], magnetometer_data[1], magnetometer_data[2]);
        // printf("NORTH, %6.2f, %6.2f, %6.2f, ", north_direction[0], north_direction[1], north_direction[2]);
        // printf("SPEED 1, %6.2f, %6.2f, %6.2f, ", wheels_speed[0], wheels_speed[1], 0.0);
        
        // printf("\n"); 

        handle_loop_timing();
    }
}

void fix_mag_axis(float* magnetometer_data){
    float temp = 0.0;
    temp = magnetometer_data[0];
    // y is x
    magnetometer_data[0] = magnetometer_data[1];
    // x is -y
    magnetometer_data[1] = -temp;
}

void check_calibrations(){
    // Checking errors of mpu6050
    find_accelerometer_error(1000);
    find_gyro_error(300);

    // Check the fuckedupedness of motors and at what percentage they start to spin.
    float speed = 25;
    // while (speed != 100)
    // {
    //     printf("Speed %9.5f\n", speed);
    //     change_speed_motor_A(speed, 0); // 34.9 the one with the broken pegs 31.5
    //     speed += 0.1;
    //     vTaskDelay(250 / portTICK_RATE_MS);
    //     change_speed_motor_A(0, 0); // sometimes the motor doesn't have enough leverage between steps of voltage
    //     vTaskDelay(250 / portTICK_RATE_MS);
    // }
    change_speed_motor_A(0, 0);
    speed = 25;
    while (speed != 100)
    {
        printf("Speed %9.5f\n", speed);
        change_speed_motor_B(speed, 0); // 26.9
        speed += 0.1;
        vTaskDelay(250 / portTICK_RATE_MS);
        change_speed_motor_B(0, 0); // sometimes the motor doesn't have enough leverage between steps of voltage
        vTaskDelay(250 / portTICK_RATE_MS);
    }
    change_speed_motor_B(0, 0);
}

void init_sensors(){
    // Init sensors
    printf("-----------------------------INITIALIZING MODULES...\n");

    bool mpu6050 = init_mpu6050(22,21, true, true, accelerometer_correction, gyro_correction, complementary_ratio);
    bool gy271 = init_gy271(22,21, false, true, hard_iron_correction, soft_iron_correction);
    init_TB6612(GPIO_NUM_33,GPIO_NUM_32, GPIO_NUM_25, GPIO_NUM_27, GPIO_NUM_26, GPIO_NUM_14);
    bool nrf24 = nrf24_init(SPI3_HOST, 17, 16);
    optical_encoder_1_result = init_optical_encoder(4, true, 0.2356, 20, 0.2);
    optical_encoder_2_result = init_optical_encoder(15, false, 0.2356, 20, 0.2);


    printf("-----------------------------INITIALIZING MODULES DONE... ");
    if (mpu6050 && gy271 && nrf24 && optical_encoder_1_result >= 0 && optical_encoder_2_result >= 0){
        printf("OK\n");
    }else{
        printf("NOT OK %d %d %d %d %d\n", mpu6050, gy271, nrf24, optical_encoder_1_result, optical_encoder_2_result);
    }

    nrf24_rx_mode(tx_address, 10);
}

void init_esp32_peripherals(){
    init_spi3();
}

void init_loop_timer(){
    // Init loop timer
    loop_start_time = esp_timer_get_time()/1000;
    vTaskDelay(1000 / portTICK_RATE_MS);
}

void get_initial_position(){
    // Find the initial position in degrees and apply it to the gyro measurement integral
    // This will tell the robot which way to go to get the actual upward
    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    gy271_magnetometer_readings_micro_teslas(magnetometer_data);
    fix_mag_axis(magnetometer_data); // Switches around the x and the y to match mpu6050

    calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation);
    calculate_yaw(magnetometer_data, &accelerometer_z_rotation);

    gyro_degrees[0] = accelerometer_x_rotation;
    gyro_degrees[1] = accelerometer_y_rotation;
    gyro_degrees[2] = accelerometer_z_rotation;

    printf("Initial location x: %.2f y: %.2f, z: %.2f\n", gyro_degrees[0], gyro_degrees[1], gyro_degrees[2]);
}


void extract_joystick_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll)
{
    // Skip the request type
    char* start = strchr(request, '/') + 1;
    char* end = strchr(start, '/');

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    int length = end - start;
    char throttle_string[length + 1];
    strncpy(throttle_string, start, length);
    throttle_string[length] = '\0';
    *throttle = atoi(throttle_string);
    //printf("'%s'\n", throttle_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char yaw_string[length + 1];
    strncpy(yaw_string, start, length);
    yaw_string[length] = '\0';
    *yaw = atoi(yaw_string);
    //printf("'%s'\n", yaw_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char pitch_string[length + 1];
    strncpy(pitch_string, start, length);
    pitch_string[length] = '\0';
    *pitch = atoi(pitch_string);
    //printf("'%s'\n", pitch_string);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char roll_string[length + 1];
    strncpy(roll_string, start, length);
    roll_string[length] = '\0';
    *roll = atoi(roll_string);
    //printf("'%s'\n", roll_string);
}

