Rokasbarasa1/ESP32-self-balancing-robot/src/main.c
void extract_request_type(char *request, uint8_t request_size, char *type_output){
    char* start = strchr(request, '/') + 1;
    char* end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    int length = end - start;
    //char type_string[length + 1];
    // You better be sure the length of the output string is big enough
    strncpy(type_output, start, length);
    type_output[length] = '\0';
    //printf("'%s'\n", type_output);

}

void extract_pid_request_values(char *request, uint8_t request_size, double *added_proportional, double *added_integral, double *added_derivative, double *added_master){
    // Skip the request type
    char* start = strchr(request, '/') + 1;
    char* end = strchr(start, '/');

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    int length = end - start;
    char added_proportional_string[length + 1];
    strncpy(added_proportional_string, start, length);
    added_proportional_string[length] = '\0';
    *added_proportional = strtod(added_proportional_string, NULL);
    //printf("'%s'\n", added_proportional);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char added_integral_string[length + 1];
    strncpy(added_integral_string, start, length);
    added_integral_string[length] = '\0';
    *added_integral = strtod(added_integral_string, NULL);
    //printf("'%s'\n", added_integral);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char added_derivative_string[length + 1];
    strncpy(added_derivative_string, start, length);
    added_derivative_string[length] = '\0';
    *added_derivative = strtod(added_derivative_string, NULL);
    //printf("'%s'\n", added_derivative);

    start = strchr(end, '/') + 1;
    end = strchr(start, '/');
    if(start == NULL || end == NULL ) return;
    length = end - start;
    char added_master_string[length + 1];
    strncpy(added_master_string, start, length);
    added_master_string[length] = '\0';
    *added_master = strtod(added_master_string, NULL);
    //printf("'%s'\n", added_master);
}

void handle_loop_timing(){
    loop_end_time = esp_timer_get_time()/1000;
    delta_loop_time = loop_end_time - loop_start_time;
    // printf("Tim: %d ms\n", delta_loop_time);
    if (delta_loop_time < (1000 / refresh_rate_hz))
    {
        vTaskDelay(((1000 / refresh_rate_hz) - delta_loop_time) / portTICK_RATE_MS);
    }
    loop_start_time = esp_timer_get_time()/1000;
}

double map_value(double value, double input_min, double input_max, double output_min, double output_max) {
    // Calculate the input and output ranges' lengths
    double input_range = input_max - input_min;
    double output_range = output_max - output_min;

    // Normalize the input value relative to the input range
    double normalized_value = (value - input_min) / input_range;

    // Scale the normalized value according to the output range
    double scaled_value = normalized_value * output_range;

    // Add the output range's minimum value to the scaled value
    double output_value = output_min + scaled_value;

    return output_value;
}

double apply_dead_zone(double value, double max_value, double min_value, double dead_zone){
    double mid_point = (max_value + min_value) / 2;
    double half_range = (max_value - min_value) / 2;
    double normalized_value = (value - mid_point) / half_range; // this will be -1 at min_value, +1 at max_value

    double dead_zone_normalized = dead_zone / half_range;

    double return_value;

    // remove the deadzone
    if (normalized_value > dead_zone_normalized) {
        return_value = (normalized_value - dead_zone_normalized) / (1.0 - dead_zone_normalized);
    } else if (normalized_value < -dead_zone_normalized) {
        return_value = (normalized_value + dead_zone_normalized) / (1.0 - dead_zone_normalized);
    } else {
        return_value = 0.0;
    }

    return return_value * half_range + mid_point; // scale back to original range
}

void calculate_speeds_no_yaw(float* acceleration, float* gyro_degrees, float* speed, float refresh_rate){
    // Converting to radians
    float pitch_radian = gyro_degrees[1] * M_PI / 180.0;
    float roll_radian = gyro_degrees[0] * M_PI / 180.0;

    // Convert acceleration to m/s^2
    double acceleration_meters[] = {acceleration[0] * 9.81, acceleration[1] * 9.81, acceleration[2] * 9.81};

    // Calculate the projected acceleration along each axis
    double speed_x_big = acceleration_meters[0] + (9.81 * sin(pitch_radian));
    double speed_y_big = acceleration_meters[1] + (9.81 * sin(roll_radian));
    double speed_z_big = acceleration_meters[2] + (9.81 * cos(pitch_radian) * cos(roll_radian));

    // Calculating speed by integrating actual acceleration over time
    speed[0] += speed_x_big / refresh_rate;
    speed[1] += speed_y_big / refresh_rate;
    speed[2] += speed_z_big / refresh_rate;
}

void calculate_speeds(float* acceleration, float* gyro_degrees, float* speed, float refresh_rate){
    // Convert to radians
    float roll_radian = gyro_degrees[0] * M_PI / 180.0;
    float pitch_radian = gyro_degrees[1] * M_PI / 180.0;
    float yaw_radian = gyro_degrees[2] * M_PI / 180.0;

    // Convert acceleration to m/s^2 and adjust for gravity
    double acceleration_meters[] = {acceleration[0] * 9.81, acceleration[1] * 9.81, acceleration[2] * 9.81};

    double rotation_matrix[3][3];

    rotation_matrix[0][0] = cos(yaw_radian)*cos(pitch_radian); 
    rotation_matrix[0][1] = cos(yaw_radian)*sin(pitch_radian)*sin(roll_radian) - sin(yaw_radian)*cos(roll_radian);
    rotation_matrix[0][2] = cos(yaw_radian)*sin(pitch_radian)*cos(roll_radian) + sin(yaw_radian)*sin(roll_radian);

    rotation_matrix[1][0] = sin(yaw_radian)*cos(pitch_radian); 
    rotation_matrix[1][1] = sin(yaw_radian)*sin(pitch_radian)*sin(roll_radian) + cos(yaw_radian)*cos(roll_radian);
    rotation_matrix[1][2] = sin(yaw_radian)*sin(pitch_radian)*cos(roll_radian) - cos(yaw_radian)*sin(roll_radian);

    rotation_matrix[2][0] = -sin(pitch_radian); 
    rotation_matrix[2][1] = cos(pitch_radian)*sin(roll_radian); 
    rotation_matrix[2][2] = cos(pitch_radian)*cos(roll_radian); 

    double speed_x_big = rotation_matrix[0][0] * acceleration_meters[0] + rotation_matrix[0][1] * acceleration_meters[1] + rotation_matrix[0][2] * acceleration_meters[2]; 
    double speed_y_big = rotation_matrix[1][3] * acceleration_meters[0] + rotation_matrix[1][4] * acceleration_meters[1] + rotation_matrix[1][5] * acceleration_meters[2]; 
    double speed_z_big = rotation_matrix[2][6] * acceleration_meters[0] + rotation_matrix[2][7] * acceleration_meters[1] + rotation_matrix[2][8] * acceleration_meters[2]; 

    speed[0] += speed_x_big / refresh_rate;
    speed[1] += speed_y_big / refresh_rate;
    speed[2] += speed_z_big / refresh_rate;
}


void send_pid_base_info_to_remote(){
    nrf24_tx_mode(tx_address, 10);
    vTaskDelay(250 / portTICK_RATE_MS);

    char *string = generate_message_pid_values_nrf24(
        base_pitch_gain_p, 
        base_pitch_gain_i, 
        base_pitch_gain_d,
        base_pitch_master_gain
    );
    
    for (size_t i = 0; i < 100; i++)
    {
        if(!nrf24_transmit(string)){
            printf("FAILED\n");
        }
    }
    free(string);
    
    nrf24_rx_mode(tx_address, 10);
}

void send_pid_added_info_to_remote(){
    nrf24_tx_mode(tx_address, 10);
    vTaskDelay(250 / portTICK_RATE_MS);

    char *string = generate_message_pid_values_nrf24(
        added_pitch_gain_p, 
        added_pitch_gain_i, 
        added_pitch_gain_d,
        added_pitch_master_gain
    );
    
    for (size_t i = 0; i < 200; i++)
    {
        if(!nrf24_transmit(string)){
            printf("FAILED\n");
        }
    }
    free(string);
    
    nrf24_rx_mode(tx_address, 10);
}

char* generate_message_pid_values_nrf24(double base_proportional, double base_integral, double base_derivative, double base_master){
    // calculate the length of the resulting string
    int length = snprintf(
        NULL, 
        0, 
        "/s/%.2f/%.2f/%.2f/%.2f/  ", 
        base_proportional, 
        base_integral, 
        base_derivative, 
        base_master
    );
    
    // allocate memory for the string
    char *string = malloc(length + 1); // +1 for the null terminator

    // format the string
    snprintf(
        (char*)string, 
        length + 1, 
        "/s/%.2f/%.2f/%.2f/%.2f/  ", 
        base_proportional, 
        base_integral, 
        base_derivative, 
        base_master
    );

    return string;
}